_Rarzrabotki/BASEBuh/InformationRegisters/ОтправкаПолучениеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОтправкаПолучениеДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументыОтправлены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументыПолучены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/BASEBuh/InformationRegisters/ОтправкаПолучениеДокументов/Forms/УстановкаПризнаков/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОК(Команда)
	Закрыть(Новый Структура("ДокументыОтправлены,ДатаОтправки,ДокументыПолучены,ДатаПолучения",ДокументыОтправлены,ДатаОтправки,ДокументыПолучены,ДатаПолучения));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("МассивДок") Тогда
		лДокументыОтправлены = Неопределено;
		лДокументыПолучены = Неопределено;
		лДатаОтправки = Неопределено;
		лДатаПолучения = Неопределено;
		Для Каждого Док Из Параметры.МассивДок Цикл
			Рег = РегистрыСведений.ОтправкаПолучениеДокументов.СоздатьМенеджерЗаписи();
			Рег.Документ = Док;
			Рег.Прочитать();
			Если Не Рег.Выбран() или Не Рег.ДокументыОтправлены Тогда
				Если лДокументыОтправлены = Неопределено Тогда
					лДокументыОтправлены = 0;
				ИначеЕсли лДокументыОтправлены = 1 Тогда
					лДокументыОтправлены = 2;
				КонецЕсли;
			Иначе
				Если лДокументыОтправлены = Неопределено Тогда
					лДокументыОтправлены = 1;
				ИначеЕсли лДокументыОтправлены = 0 Тогда
					лДокументыОтправлены = 2;
				КонецЕсли;
			КонецЕсли;
			Если Не Рег.Выбран() или Не ЗначениеЗаполнено(Рег.ДатаОтправки) Тогда
				Если лДатаОтправки = Неопределено Тогда
					лДатаОтправки = '00010101';
				ИначеЕсли лДатаОтправки <> Рег.ДатаОтправки Тогда
					лДатаОтправки = Ложь;
				КонецЕсли;
			Иначе
				Если лДатаОтправки = Неопределено Тогда
					лДатаОтправки = Рег.ДатаОтправки;
				ИначеЕсли лДатаОтправки <> Рег.ДатаОтправки Тогда
					лДатаОтправки = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если Не Рег.Выбран() или Не Рег.ДокументыПолучены Тогда
				Если лДокументыПолучены = Неопределено Тогда
					лДокументыПолучены = 0;
				ИначеЕсли лДокументыПолучены = 1 Тогда
					лДокументыПолучены = 2;
				КонецЕсли;
			Иначе
				Если лДокументыПолучены = Неопределено Тогда
					лДокументыПолучены = 1;
				ИначеЕсли лДокументыПолучены = 0 Тогда
					лДокументыПолучены = 2;
				КонецЕсли;
			КонецЕсли;
			Если Не Рег.Выбран() или Не ЗначениеЗаполнено(Рег.ДатаПолучения) Тогда
				Если лДатаПолучения = Неопределено Тогда
					лДатаПолучения = '00010101';
				ИначеЕсли лДатаПолучения <> Рег.ДатаПолучения Тогда
					лДатаПолучения = Ложь;
				КонецЕсли;
			Иначе
				Если лДатаПолучения = Неопределено Тогда
					лДатаПолучения = Рег.ДатаПолучения;
				ИначеЕсли лДатаПолучения <> Рег.ДатаПолучения Тогда
					лДатаПолучения = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ДокументыОтправлены = лДокументыОтправлены;
		ДокументыПолучены = лДокументыПолучены;
		Если ЗначениеЗаполнено(лДатаОтправки) Тогда
			ДатаОтправки = лДатаОтправки;
		КонецЕсли;
		Если ЗначениеЗаполнено(лДатаПолучения) Тогда
			ДатаПолучения = лДатаПолучения;
		КонецЕсли;
			
	КонецЕсли;
КонецПроцедуры
